{
  "architectures": [
    "DeepseekV32ForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 0,
  "eos_token_id": 1,
  "ep_size": 1,
  "first_k_dense_replace": 3,
  "hidden_act": "silu",
  "hidden_size": 7168,
  "index_head_dim": 128,
  "index_n_heads": 64,
  "index_topk": 2048,
  "initializer_range": 0.02,
  "intermediate_size": 18432,
  "kv_lora_rank": 512,
  "max_position_embeddings": 163840,
  "model_type": "deepseek_v32",
  "moe_intermediate_size": 2048,
  "moe_layer_freq": 1,
  "n_group": 8,
  "n_routed_experts": 256,
  "n_shared_experts": 1,
  "norm_topk_prob": true,
  "num_attention_heads": 128,
  "num_experts_per_tok": 8,
  "num_hidden_layers": 61,
  "num_key_value_heads": 128,
  "num_nextn_predict_layers": 1,
  "q_lora_rank": 1536,
  "qk_nope_head_dim": 128,
  "qk_rope_head_dim": 64,
  "quantization_config": {
    "algo_config": null,
    "exclude": [
      "model.layers.0.self_attn.indexer.weights_proj.weight",
      "model.layers.1.self_attn.indexer.weights_proj.weight",
      "model.layers.2.self_attn.indexer.weights_proj.weight",
      "model.layers.3.self_attn.indexer.weights_proj.weight",
      "model.layers.4.self_attn.indexer.weights_proj.weight",
      "model.layers.5.self_attn.indexer.weights_proj.weight",
      "model.layers.6.self_attn.indexer.weights_proj.weight",
      "model.layers.7.self_attn.indexer.weights_proj.weight",
      "model.layers.8.self_attn.indexer.weights_proj.weight",
      "model.layers.9.self_attn.indexer.weights_proj.weight",
      "model.layers.10.self_attn.indexer.weights_proj.weight",
      "model.layers.11.self_attn.indexer.weights_proj.weight",
      "model.layers.12.self_attn.indexer.weights_proj.weight",
      "model.layers.13.self_attn.indexer.weights_proj.weight",
      "model.layers.14.self_attn.indexer.weights_proj.weight",
      "model.layers.15.self_attn.indexer.weights_proj.weight",
      "model.layers.16.self_attn.indexer.weights_proj.weight",
      "model.layers.17.self_attn.indexer.weights_proj.weight",
      "model.layers.18.self_attn.indexer.weights_proj.weight",
      "model.layers.19.self_attn.indexer.weights_proj.weight",
      "model.layers.20.self_attn.indexer.weights_proj.weight",
      "model.layers.21.self_attn.indexer.weights_proj.weight",
      "model.layers.22.self_attn.indexer.weights_proj.weight",
      "model.layers.23.self_attn.indexer.weights_proj.weight",
      "model.layers.24.self_attn.indexer.weights_proj.weight",
      "model.layers.25.self_attn.indexer.weights_proj.weight",
      "model.layers.26.self_attn.indexer.weights_proj.weight",
      "model.layers.27.self_attn.indexer.weights_proj.weight",
      "model.layers.28.self_attn.indexer.weights_proj.weight",
      "model.layers.29.self_attn.indexer.weights_proj.weight",
      "model.layers.30.self_attn.indexer.weights_proj.weight",
      "model.layers.31.self_attn.indexer.weights_proj.weight",
      "model.layers.32.self_attn.indexer.weights_proj.weight",
      "model.layers.33.self_attn.indexer.weights_proj.weight",
      "model.layers.34.self_attn.indexer.weights_proj.weight",
      "model.layers.35.self_attn.indexer.weights_proj.weight",
      "model.layers.36.self_attn.indexer.weights_proj.weight",
      "model.layers.37.self_attn.indexer.weights_proj.weight",
      "model.layers.38.self_attn.indexer.weights_proj.weight",
      "model.layers.39.self_attn.indexer.weights_proj.weight",
      "model.layers.40.self_attn.indexer.weights_proj.weight",
      "model.layers.41.self_attn.indexer.weights_proj.weight",
      "model.layers.42.self_attn.indexer.weights_proj.weight",
      "model.layers.43.self_attn.indexer.weights_proj.weight",
      "model.layers.44.self_attn.indexer.weights_proj.weight",
      "model.layers.45.self_attn.indexer.weights_proj.weight",
      "model.layers.46.self_attn.indexer.weights_proj.weight",
      "model.layers.47.self_attn.indexer.weights_proj.weight",
      "model.layers.48.self_attn.indexer.weights_proj.weight",
      "model.layers.49.self_attn.indexer.weights_proj.weight",
      "model.layers.50.self_attn.indexer.weights_proj.weight",
      "model.layers.51.self_attn.indexer.weights_proj.weight",
      "model.layers.52.self_attn.indexer.weights_proj.weight",
      "model.layers.53.self_attn.indexer.weights_proj.weight",
      "model.layers.54.self_attn.indexer.weights_proj.weight",
      "model.layers.55.self_attn.indexer.weights_proj.weight",
      "model.layers.56.self_attn.indexer.weights_proj.weight",
      "model.layers.57.self_attn.indexer.weights_proj.weight",
      "model.layers.58.self_attn.indexer.weights_proj.weight",
      "model.layers.59.self_attn.indexer.weights_proj.weight",
      "model.layers.60.self_attn.indexer.weights_proj.weight",
      "model.layers.61.self_attn.indexer.weights_proj.weight",
      "model.layers.3.mlp.gate.weight",
      "model.layers.4.mlp.gate.weight",
      "model.layers.5.mlp.gate.weight",
      "model.layers.6.mlp.gate.weight",
      "model.layers.7.mlp.gate.weight",
      "model.layers.8.mlp.gate.weight",
      "model.layers.9.mlp.gate.weight",
      "model.layers.10.mlp.gate.weight",
      "model.layers.11.mlp.gate.weight",
      "model.layers.12.mlp.gate.weight",
      "model.layers.13.mlp.gate.weight",
      "model.layers.14.mlp.gate.weight",
      "model.layers.15.mlp.gate.weight",
      "model.layers.16.mlp.gate.weight",
      "model.layers.17.mlp.gate.weight",
      "model.layers.18.mlp.gate.weight",
      "model.layers.19.mlp.gate.weight",
      "model.layers.20.mlp.gate.weight",
      "model.layers.21.mlp.gate.weight",
      "model.layers.22.mlp.gate.weight",
      "model.layers.23.mlp.gate.weight",
      "model.layers.24.mlp.gate.weight",
      "model.layers.25.mlp.gate.weight",
      "model.layers.26.mlp.gate.weight",
      "model.layers.27.mlp.gate.weight",
      "model.layers.28.mlp.gate.weight",
      "model.layers.29.mlp.gate.weight",
      "model.layers.30.mlp.gate.weight",
      "model.layers.31.mlp.gate.weight",
      "model.layers.32.mlp.gate.weight",
      "model.layers.33.mlp.gate.weight",
      "model.layers.34.mlp.gate.weight",
      "model.layers.35.mlp.gate.weight",
      "model.layers.36.mlp.gate.weight",
      "model.layers.37.mlp.gate.weight",
      "model.layers.38.mlp.gate.weight",
      "model.layers.39.mlp.gate.weight",
      "model.layers.40.mlp.gate.weight",
      "model.layers.41.mlp.gate.weight",
      "model.layers.42.mlp.gate.weight",
      "model.layers.43.mlp.gate.weight",
      "model.layers.44.mlp.gate.weight",
      "model.layers.45.mlp.gate.weight",
      "model.layers.46.mlp.gate.weight",
      "model.layers.47.mlp.gate.weight",
      "model.layers.48.mlp.gate.weight",
      "model.layers.49.mlp.gate.weight",
      "model.layers.50.mlp.gate.weight",
      "model.layers.51.mlp.gate.weight",
      "model.layers.52.mlp.gate.weight",
      "model.layers.53.mlp.gate.weight",
      "model.layers.54.mlp.gate.weight",
      "model.layers.55.mlp.gate.weight",
      "model.layers.56.mlp.gate.weight",
      "model.layers.57.mlp.gate.weight",
      "model.layers.58.mlp.gate.weight",
      "model.layers.59.mlp.gate.weight",
      "model.layers.60.mlp.gate.weight",
      "model.layers.61.mlp.gate.weight",
      "lm_head",
      "model.layers.61.eh_proj.weight",
      "model.layers.61.shared_head.head"
    ],
    "export": {
      "kv_cache_group": [],
      "min_kv_scale": 0.0,
      "pack_method": "reorder",
      "weight_format": "real_quantized",
      "weight_merge_groups": null
    },
    "global_quant_config": {
      "bias": null,
      "input_tensors": {
        "ch_axis": 1,
        "dtype": "fp8_e4m3",
        "group_size": null,
        "is_dynamic": true,
        "is_scale_quant": false,
        "mx_element_dtype": null,
        "observer_cls": "PerChannelMinMaxObserver",
        "qscheme": "per_channel",
        "round_method": null,
        "scale_calculation_mode": null,
        "scale_format": null,
        "scale_type": null,
        "symmetric": null
      },
      "output_tensors": null,
      "target_device": null,
      "weight": {
        "ch_axis": 0,
        "dtype": "fp8_e4m3",
        "group_size": null,
        "is_dynamic": false,
        "is_scale_quant": false,
        "mx_element_dtype": null,
        "observer_cls": "PerChannelMinMaxObserver",
        "qscheme": "per_channel",
        "round_method": null,
        "scale_calculation_mode": null,
        "scale_format": null,
        "scale_type": null,
        "symmetric": null
      }
    },
    "kv_cache_quant_config": {},
    "layer_quant_config": {},
    "layer_type_quant_config": {},
    "quant_method": "quark",
    "quant_mode": "eager_mode",
    "softmax_quant_spec": null,
    "version": "0.10+b8ad5c1d29"
  },
  "rms_norm_eps": 1e-06,
  "rope_scaling": {
    "beta_fast": 32,
    "beta_slow": 1,
    "factor": 40,
    "mscale": 1.0,
    "mscale_all_dim": 1.0,
    "original_max_position_embeddings": 4096,
    "type": "yarn"
  },
  "rope_theta": 10000,
  "routed_scaling_factor": 2.5,
  "scoring_func": "sigmoid",
  "tie_word_embeddings": false,
  "topk_group": 4,
  "topk_method": "noaux_tc",
  "torch_dtype": "bfloat16",
  "transformers_version": "4.44.2",
  "use_cache": true,
  "v_head_dim": 128,
  "vocab_size": 129280
}
